app/views/events/_utilisateurs_list.html.erb

<% if event.utilisateurs.any? %>
---
SELECT  1 AS one FROM "utilisateurs" INNER JOIN "event_utilisateurs" ON "utilisateurs"."id" = "event_utilisateurs"."utilisateur_id" WHERE "event_utilisateurs"."event_id" = ? LIMIT ?  [["event_id", 1], ["LIMIT", 1]]