app/views/events/index.html.erb

        <td><%= event.rate %></td>
        <td><%= event.utilisateurs.count %></td>
---
SELECT COUNT(*) FROM "utilisateurs" INNER JOIN "event_utilisateurs" ON "utilisateurs"."id" = "event_utilisateurs"."utilisateur_id" WHERE "event_utilisateurs"."event_id" = ?  [["event_id", 1]]