app/views/events/show.html.erb

SELECT  1 AS one FROM "utilisateurs" INNER JOIN "event_utilisateurs" ON "utilisateurs"."id" = "event_utilisateurs"."utilisateur_id" WHERE "event_utilisateurs"."event_id" = ? LIMIT ?  [["event_id", 1], ["LIMIT", 1]]
SELECT "utilisateurs".* FROM "utilisateurs" INNER JOIN "event_utilisateurs" ON "utilisateurs"."id" = "event_utilisateurs"."utilisateur_id" WHERE "event_utilisateurs"."event_id" = ?  [["event_id", 1]]
---
        <% if utilisateur_signed_in? %>
          <% if !@event.utilisateurs.any? { |h| h.id == current_utilisateur.id } %>