app/controllers/constructeurs_controller.rb

  def index
    @constructeurs = Constructeur.all
---
SELECT "constructeurs".* FROM "constructeurs"

  def create
    @constructeur = Constructeur.new(constructeur_params)
    if @constructeur.save
---
INSERT INTO "constructeurs" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Renault"], ["created_at", 2017-06-07 14:43:28 UTC], ["updated_at", 2017-06-07 14:43:28 UTC]]

    def set_constructeur
      @constructeur = Constructeur.find(params[:id])
---
SELECT  "constructeurs".* FROM "constructeurs" WHERE "constructeurs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]