app/controllers/events_controller.rb

INSERT INTO "events" ("name", "startDate", "endDate", "place", "rate", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @event = Event.new(event_params)
    if @event.save

UPDATE "events" SET "avatar_updated_at" = ?, "updated_at" = ?, "avatar_file_name" = ? WHERE "events"."id" = ?  [["avatar_updated_at", 2017-07-09 15:18:11 UTC], ["updated_at", 2017-07-09 15:18:12 UTC], ["avatar_file_name", "electric.jpg"], ["id", 2]]
---
  def update
    if @event.update(event_params)