app/controllers/utilisateurs_controller.rb

  def index
    @utilisateurs = Utilisateur.all
---
SELECT "utilisateurs".* FROM "utilisateurs"

  def create
    @utilisateur = Utilisateur.new(utilisateur_params)

    respond_to do |format|
      if @utilisateur.save
---
INSERT INTO "utilisateurs" ("firstName", "lastName", "email", "numAddress", "address", "city", "phone", "isActive", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @utilisateur.update(utilisateur_params)
---
UPDATE "utilisateurs" SET "pseudo" = ?, "firstName" = ?, "lastName" = ?, "address" = ?, "city" = ?, "phone" = ?, "isActive" = ?, "updated_at" = ? WHERE "utilisateurs"."id" = ?  [["pseudo", "ijoijoij"], ["firstName", ""], ["lastName", ""], ["address", ""], ["city", ""], ["phone", ""], ["isActive", false], ["updated_at", 2017-07-10 18:51:52 UTC], ["id", 2]]

    def set_utilisateur
      @utilisateur = Utilisateur.find(params[:id])
---
SELECT  "utilisateurs".* FROM "utilisateurs" WHERE "utilisateurs"."id" = ? ORDER BY "utilisateurs"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]