app/controllers/voitures_controller.rb

SELECT "voitures".* FROM "voitures"
---
  def index
    @voitures = Voiture.all

INSERT INTO "voitures" ("couleur", "description", "created_at", "updated_at", "constructeur_id") VALUES (?, ?, ?, ?, ?)  [["couleur", "Bleue"], ["description", "Blabla"], ["created_at", 2017-06-07 16:20:48 UTC], ["updated_at", 2017-06-07 16:20:48 UTC], ["constructeur_id", 1]]
---
  def create
    @voiture = Voiture.new(voiture_params)

    respond_to do |format|
      if @voiture.save

UPDATE "voitures" SET "name" = ?, "couleur" = ?, "updated_at" = ? WHERE "voitures"."id" = ?  [["name", "Twintwin2"], ["couleur", "Rouge"], ["updated_at", 2017-06-07 16:40:40 UTC], ["id", 3]]
---
  def update
    respond_to do |format|
      if @voiture.update(voiture_params)

DELETE FROM "voitures" WHERE "voitures"."id" = ?  [["id", 1]]
---
  def destroy
    @voiture.destroy

SELECT  "voitures".* FROM "voitures" WHERE "voitures"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def set_voiture
      @voiture = Voiture.find(params[:id])